Repository: ystk/debian-dos2unix
Catalog: po/dos2unix/*.po
Languages: nl

source: dos2unix %s (%s) Usage: dos2unix [-fhkLlqV] [-c convmode] [-o file ...] [-n infile outfile ...] -c --convmode conversion mode convmode ascii, 7bit, iso, mac, default to ascii -f --force force conversion of all files -h --help give this help -k --keepdate keep output file date -L --license display software license -l --newline add additional newline -n --newfile write to new file infile original file in new file mode outfile output file in new file mode -o --oldfile write to old file file ... files to convert in old file mode -q --quiet quiet mode, suppress all warnings always on in stdio mode -V --version display version number
nl: dos2unix %s (%s) Usage: dos2unix [-fhkLlqV] [-c convmode] [-o file ...] [-n infile outfile ...] -c --convmode conversie modus convmode ascii, 7bit, iso, mac, standaard is ascii -f --force forceer conversie van alle bestanden -h --help toon deze help tekst -k --keepdate behoud datum uitvoerbestand -L --license toon software licentie -l --newline voeg extra regeleinde toe -n --newfile schrijf naar nieuw bestand infile origineel bestand in 'nieuw bestand modus' outfile uitvoerbestand in 'nieuw bestand modus' -o --oldfile overschrijf oud bestand file ... te converteren bestanden in 'oud bestand modus' -q --quiet stille werking, onderdruk alle waarschuwingen altijd aan in stdio modus -V --version toon versie nummer

source: With native language support.
nl: Met moedertaal ondersteuning.

source: dos2unix: can not write to output file
nl: dos2unix: kan niet schrijven naar uitvoerbestand

source: dos2unix: program error, invalid conversion mode %d
nl: dos2unix: programma fout, ongeldige conversie modus %d

source: dos2unix: Failed to open temporary output file
nl: dos2unix: Niet gelukt om tijdelijk uitvoerbestand te openen

source: dos2unix: using %s as temporary file
nl: dos2unix: %s wordt als tijdelijk bestand gebruikt

source: dos2unix: problems renaming '%s' to '%s'
nl: dos2unix: problemen met hernoemen van '%s' naar '%s'

source: output file remains in '%s'
nl: uitvoerbestand blijft in '%s'

source: dos2unix: error: Value of environment variable DOS2UNIX_LOCALEDIR is too long.
nl: dos2unix: fout: Waarde van omgevingsvariabele DOS2UNIX_LOCALEDIR is te lang.

source: dos2unix: invalid %s conversion mode specified
nl: dos2unix: ongeldige %s conversie modus gespecificeerd

source: dos2unix: option '%s' requires an argument
nl: dos2unix: optie '%s' heeft een argument nodig

source: dos2unix: target of file %s not specified in new file mode
nl: dos2unix: doel van bestand %s is niet gespecificeerd in 'nieuw bestand modus'

source: dos2unix: Skipping %s, not a regular file.
nl: dos2unix: %s wordt overgeslagen, omdat het geen regulier bestand is.

source: dos2unix: Skipping binary file %s
nl: dos2unix: Binair bestand %s wordt overgeslagen

source: dos2unix: converting file %s to file %s in UNIX format ...
nl: dos2unix: converteren bestand %s naar bestand %s in UNIX formaat ...

source: dos2unix: problems converting file %s to file %s
nl: dos2unix: problemen met conversie van bestand %s naar bestand %s

source: dos2unix: converting file %s to UNIX format ...
nl: dos2unix: converteren bestand %s naar UNIX formaat ...

source: dos2unix: problems converting file %s
nl: dos2unix: problemen met conversie van bestand %s
