Repository: ystk/debian-dos2unix
Catalog: po/*.po
Languages: ru

source: Copyright (C) 2009-2013 Erwin Waterlander Copyright (C) 1998 Christian Wurll (Version 3.1) Copyright (C) 1998 Bernd Johannes Wuebben (Version 3.0) Copyright (C) 1994-1995 Benjamin Lin All rights reserved.
ru: Авторское право (C) 2009-2013 Erwin Waterlander Авторское право (C) 1998 Christian Wurll (Version 3.1) Авторское право (C) 1998 Bernd Johannes Wuebben (Version 3.0) Авторское право (C) 1994-1995 Benjamin Lin Все права защищены.

source: Binary symbol 0x00%02X found at line %d
ru: Бинарный символ 0x00%02X, обнаруженный в строке %d

source: can not write to output file: %s
ru: не удалось записать в выходной файл: %s

source: program error, invalid conversion mode %d
ru: ошибка в программе, неверный режим преобразования %d

source: using code page %d.
ru: используется кодировка %d.

source: Binary symbol 0x%02X found at line %d
ru: Бинарный символ 0x%02X, обнаруженный в строке %d

source: Failed to open temporary output file: %s
ru: Не удалось открыть временный выходной файл: %s

source: using %s as temporary file
ru: использование %s в качестве временного файла

source: Failed to write to temporary output file %s: %s
ru: Не удалось записать во временный выходной файл %s: %s

source: Failed to change the permissions of temporary output file %s: %s
ru: Не удалось изменить права доступа ко временному выходному файлу %s: %s

source: Failed to change the owner and group of temporary output file %s: %s
ru: Не удалось изменить владельца и группу временного выходного файла %s: %s

source: problems resolving symbolic link '%s'
ru: конфликт при разрешении символической ссылки '%s'

source: output file remains in '%s'
ru: выходной файл остается в '%s'

source: problems renaming '%s' to '%s': %s
ru: проблемы при переименовании '%s' в '%s': %s

source: which is the target of symbolic link '%s'
ru: который является целью символической ссылки '%s'

source: error: Value of environment variable DOS2UNIX_LOCALEDIR is too long.
ru: ошибка: Значение переменной среды DOS2UNIX_LOCALEDIR слишком длинное.

source: active code page: %d
ru: активная кодовая страница: %d

source: invalid %s conversion mode specified
ru: задан неправильный %s режим преобразования

source: option '%s' requires an argument
ru: для опции '%s' требуется аргумент

source: target of file %s not specified in new file mode
ru: цель файла %s не задана в новом режиме файла

source: Skipping %s, not a regular file.
ru: Пропуск %s, не является подходящим файлом.

source: Skipping %s, output file %s is a symbolic link.
ru: Пропуск %s, выходной файл %s является символической ссылкой.

source: Skipping symbolic link %s, target is not a regular file.
ru: Пропуск символической ссылки %s, цель не является подходящим файлом.

source: Skipping %s, target of symbolic link %s is not a regular file.
ru: Пропуск %s, цель символической ссылки %s не является подходящим файлом.

source: Skipping binary file %s
ru: Пропуск бинарного файла %s

source: code page %d is not supported.
ru: кодовая страница %d не поддерживается.

source: Skipping UTF-16 file %s, the current locale character encoding is not UTF-8.
ru: Пропуск UTF-16 файла %s, текущая символьная кодировка не UTF-8.

source: Skipping UTF-16 file %s, the size of wchar_t is %d bytes.
ru: Пропуск UTF-16 файла %s, размер wchar_t составляет %d байт.

source: Skipping UTF-16 file %s, an UTF-16 conversion error occurred.
ru: Пропуск UTF-16 файла %s, возникла ошибка преобразования UTF-16.

source: converting file %s to file %s in Unix format ...
ru: преобразование файла %s в файл %s в формат Unix ...

source: problems converting file %s to file %s
ru: проблемы при преобразовании файла %s в файл %s

source: Skipping symbolic link %s.
ru: Пропуск символической ссылки %s.

source: converting file %s to Unix format ...
ru: преобразование файла %s в формат Unix ...

source: problems converting file %s
ru: проблемы при преобразовании файла %s

source: Copyright (C) 2009-2013 Erwin Waterlander Copyright (C) 1994-1995 Benjamin Lin All rights reserved.
ru: Авторское право (C) 2009-2013 Erwin Waterlander Авторское право (C) 1994-1995 Benjamin Lin Все права защищены.

source: converting file %s to file %s in Mac format ...
ru: преобразование файла %s в файл %s в формат Mac ...

source: converting file %s to file %s in DOS format ...
ru: преобразование файла %s в файл %s в формат DOS ...

source: converting file %s to Mac format ...
ru: преобразование файла %s в формат Mac ...

source: converting file %s to DOS format ...
ru: преобразование файла %s в формат DOS ...

source: %s %s (%s) Usage: %s [options] [file ...] [-n infile outfile ...] -ascii convert only line breaks (default) -iso conversion between DOS and ISO-8859-1 character set -1252 Use Windows code page 1252 (Western European) -437 Use DOS code page 437 (US) (default) -850 Use DOS code page 850 (Western European) -860 Use DOS code page 860 (Portuguese) -863 Use DOS code page 863 (French Canadian) -865 Use DOS code page 865 (Nordic) -7 Convert 8 bit characters to 7 bit space -c, --convmode conversion mode convmode ascii, 7bit, iso, mac, default to ascii -f, --force force conversion of binary files -h, --help give this help -k, --keepdate keep output file date -L, --license display software license -l, --newline add additional newline -m, --add-bom add UTF-8 Byte Order Mark -n, --newfile write to new file infile original file in new file mode outfile output file in new file mode -o, --oldfile write to old file (default) file ... files to convert in old file mode -q, --quiet quiet mode, suppress all warnings always on in stdio mode -s, --safe skip binary files (default)
ru: %s %s (%s) Использование: %s [опции] [файл ...] [-n входной_файл выходной_файл ...] -ascii преобразовать только конец строки (по умолчанию) -iso преобразовать DOS в ISO-8859-1 -1252 Использовать кодировку Windows 1252 (Западно-Европейский) -437 Использовать кодировку DOS 437 (US) (по умолчанию) -850 Использовать кодировку DOS 850 (Западно-Европейский) -860 Использовать кодировку DOS 860 (Португальский) -863 Использовать кодировку DOS 863 (Франко-Канадский) -865 Использовать кодировку DOS 865 (Скандинавский) -7 Преобразовать 8-битные символы в 7-битные с пробелом -c, --convmode режим преобразования convmode ascii, 7bit, iso, mac, по умолчанию в ascii -f, --force управление преобразованием бинарных файлов -h, --help вызов справки -k, --keepdate сохранить дату выходного файла -L, --license отобразить лицензию программного обеспечения -l, --newline добавить дополнительный разделитель строк -m, --add-bom добавить UTF-8 метку порядка байтов (BOM) -n, --newfile записать в новый файл infile исходный файл с новым режимным кодом файла outfile выходной файл с новым режимным кодом файла -o, --oldfile записать в старый файл (по умолчанию) file ... файлы для преобразования в старый режимный код файла -q, --quiet тихий режим, скрыть все предупреждения всегда включен в режиме stdio -s, --safe пропустить бинарные файлы (по умолчанию)

source: -ul, --assume-utf16le Assume that the input format is UTF-16LE -ub, --assume-utf16be Assume that the input format is UTF-16BE
ru: -ul, --assume-utf16le Предположить что входной формат UTF-16LE -ub, --assume-utf16be Предположить что входной формат UTF-16BE

source: -F, --follow-symlink follow symbolic links and convert the targets -R, --replace-symlink replace symbolic links with converted files (original target files remain unchanged) -S, --skip-symlink keep symbolic links and targets unchanged (default)
ru: -F, --follow-symlink следовать символическим ссылкам и преобразовать цели -R, --replace-symlink заменить символические ссылки преобразованными файлами (оригинальные целевые файлы останутся без изменений) -S, --skip-symlink оставить символические ссылки и цели без изменений (по умолчанию)

source: -V, --version display version number
ru: -V, --version отобразить номер версии

source: DOS 16 bit version (WATCOMC).
ru: DOS 16 bit версия (WATCOMC).

source: DOS 16 bit version (TURBOC).
ru: DOS 16 bit версия (TURBOC).

source: DOS 32 bit version (WATCOMC).
ru: DOS 32 bit версия (WATCOMC).

source: DOS 32 bit version (DJGPP).
ru: DOS 32 bit версия (DJGPP).

source: MSYS version.
ru: MSYS версия.

source: Cygwin version.
ru: Cygwin версия.

source: Windows 64 bit version (MinGW-w64).
ru: Windows 64 bit версия (MinGW-w64).

source: Windows 32 bit version (WATCOMC).
ru: Windows 32 bit версия (WATCOMC).

source: Windows 32 bit version (MinGW-w64).
ru: Windows 32 bit версия (MinGW-w64).

source: Windows 32 bit version (MinGW).
ru: Windows 32 bit версия (MinGW).

source: Windows 64 bit version (MSVC %d).
ru: Windows 64 bit версия (MSVC %d).

source: Windows 32 bit version (MSVC %d).
ru: Windows 32 bit версия (MSVC %d).

source: OS/2 version (WATCOMC).
ru: OS/2 версия (WATCOMC).

source: OS/2 version (EMX).
ru: OS/2 версия (EMX).

source: With Unicode UTF-16 support.
ru: С поддержкой Unicode UTF-16.

source: Without Unicode UTF-16 support.
ru: Без поддержки Unicode UTF-16.

source: With native language support.
ru: С поддержкой родного языка.
